gitConverter/src/Reports/ОтчетПоЗадачам/ОтчетПоЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоЗадачам</name>
</mdclass:Report>

gitConverter/src/Documents/Задачи/Задачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Задачи</name>
  <attributes>
    <name>КодТрекера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодФС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>План</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Факт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачаПредшественник</name>
    <type>
      <types>DocumentRef.Задачи</types>
    </type>
  </attributes>
</mdclass:Document>

gitConverter/src/Reports/ОтчетПоЗадачам/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекДата = Дата(Год(ТекущаяДатаСеанса()), Месяц(ТекущаяДатаСеанса()), День(ТекущаяДатаСеанса()));
	
	ТекДень = Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы[0].Метки.Добавить(ТекДата);
	ТекДень.ЦветЛинии = WebЦвета.Зеленый;
	
	СформироватьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	Диаграмма.Очистить();
	
	ВыходныеЗаПериод = Общий.ПолучитьВыходныеЗаПериод();
	ВыходныеЗаПериод.Индексы.Добавить("Календарь");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи.Ссылка КАК Ссылка,
		|	Задачи.КодТрекера КАК КодТрекера,
		|	Задачи.Наименование КАК Наименование,
		|	Задачи.Исполнитель КАК Исполнитель,
		|	Задачи.ДатаНачала КАК ДатаНачала,
		|	Задачи.ДатаОкончания КАК ДатаОкончания,
		|	Задачи.ЗадачаПредшественник КАК ЗадачаПредшественник,
		|	Задачи.КодФС КАК КодФС
		|ИЗ
		|	Документ.Задачи КАК Задачи
		|ГДЕ ИСТИНА
		|УПОРЯДОЧИТЬ ПО
		|	Исполнитель,
		|	ДатаНачала УБЫВ
		|ИТОГИ ПО
		|	Исполнитель";
	
	Если Исполнители.Количество() Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ ИСТИНА", "Где Задачи.Исполнитель В (&Исполнители)");
		Запрос.УстановитьПараметр("Исполнители", Исполнители);
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИсполнитель = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СерияЗадачи = Диаграмма.Серии.Добавить();
	СерияЗадачи.Текст = "Задачи";
	СерияЗадачи.Цвет = WebЦвета.СинеФиолетовый;
	
	//СерияВыходные = Диаграмма.Серии.Добавить();
	//СерияВыходные.Текст = "Выходные";
	//СерияВыходные.Цвет = WebЦвета.КрасноФиолетовый;
	
	//Серия = Диаграмма.УстановитьСерию("");
	
	Диаграмма.ОбластьПостроения.РазмещениеТекста = ТипРазмещенияТекстаДиаграммыГанта.Обрезать;
	
	Пока ВыборкаИсполнитель.Следующий() Цикл
		
		ТочкаИсполнитель = Диаграмма.УстановитьТочку(ВыборкаИсполнитель.Исполнитель);
		ЗначениеИсполнитель = Диаграмма.ПолучитьЗначение(ТочкаИсполнитель, СерияЗадачи);
		
		Если ЗначениеЗаполнено(ВыборкаИсполнитель.Исполнитель.Календарь) Тогда
		
			Отбор = Новый Структура("Календарь", ВыборкаИсполнитель.Исполнитель.Календарь);
		Иначе
			Отбор = Новый Структура("Календарь", Справочники.Календари.НайтиПоНаименованию("Российская Федерация"));
		КонецЕсли;
		
		
		УстановитьТочкиВыходные(ВыходныеЗаПериод.НайтиСтроки(Отбор), ТочкаИсполнитель, СерияЗадачи);
		
		Выборка = ВыборкаИсполнитель.Выбрать();
	
		Пока Выборка.Следующий() Цикл
			
			
			Интервал = ЗначениеИсполнитель.Добавить();
			Интервал.Начало = Выборка.ДатаНачала;
			Интервал.Конец = КонецДня(Выборка.ДатаОкончания);
			
			Интервал.Расшифровка = Выборка.Ссылка;
			Интервал.Текст = Выборка.КодФС;
			
			
			Точка = ТочкаИсполнитель.Точки.Добавить();
			Точка.Значение = Выборка.КодТрекера + " | " + Выборка.Наименование;
			Точка.Текст = Выборка.КодТрекера + " | " + Выборка.Наименование;
			
			УстановитьТочкиВыходные(ВыходныеЗаПериод, Точка, СерияЗадачи);
			
			Значение = Диаграмма.ПолучитьЗначение(Точка, СерияЗадачи);
			
			Интервал = Значение.Добавить();
			Интервал.Начало = Выборка.ДатаНачала;
			Интервал.Конец = КонецДня(Выборка.ДатаОкончания);
			
			Интервал.Расшифровка = Выборка.Ссылка;
			Интервал.Текст = Выборка.КодФС;
			//Интервал.Цвет =  WebЦвета.КрасноФиолетовый;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьТочкиВыходные(ВыходныеЗаПериод, Точка, Серия)
	
	Для каждого Стр Из ВыходныеЗаПериод Цикл
		ИнтервалыФона = Диаграмма.ИнтервалыФона.Добавить(НачалоДня( Стр.ДатаГрафика ), КонецДня( Стр.ДатаГрафика ));
		ИнтервалыФона.Цвет =  WebЦвета.СветлоСерый;
		
		//Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
		//
		//Интервал = Значение.Добавить();
		//Интервал.Начало = НачалоДня( Стр.ДатаГрафика );
		//Интервал.Конец = КонецДня( Стр.ДатаГрафика );
		//
		//Интервал.Цвет =  WebЦвета.СветлоСерый;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьНаСервере();
КонецПроцедуры
